{
    "name": "Creative Labs Inspire T3100 29 W 2.1-Channel Speakers",
    "Manufacturer": "Creative Labs",
    "Model": "Inspire T3100",
    "Part #": "51MF0336AA000",
    "Configuration": "2.1",
    "Total Wattage": "29 W",
    "Frequency Response": "40 Hz - 20 kHz",
    "Power (Front, Each)": "6 W",
    "Power (Subwoofer)": "17 W",
    "Features": "[Full spectrum audio from two-way design speakers, Listen to your audio in vibrant color. Cymbals and triangles and other high-end frequencies become more detailed, thanks to the Tweeter, while acoustic guitars and piano become warmer with more character, especially in vocals and music. Possible only through the High performance mid-range driver that can recreate a realistic live musical experience., More power and depth, Designed exclusively to produce the lower range of audible frequencies, such as the bass, this powerful subwoofer packs 17Watts RMS to enhance the 2-Way performance, giving more power and depth for your music listening., Stylish metal grille complements your desktop, Make any room or décor chic with the neutral color of Black and Silver. These satellites not only deliver an outstanding performance, they also look good on their own., Flared port for lower and cleaner bass response, Fine-tuned to ensure the smoothest passage of air-flow; the result thus speaks for itself. Cleaner and a more even bass response., Easy Controls for Private Listening, Plug in your favorite headphones and enjoy your music without disturbing those around you. The convenient power and volume control makes it easy to control your music., Small footprint / Magnetically-shielded, Maximise your area for optimal performance. The small satellite footprint makes it easy to place anywhere, even mount them to the wall. Or if you prefer to place them close to your desktop or TV, the magnetically-shielded satellites won't cause any interference.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/HrDzK8/creative-labs-speakers-51mf0336aa000"
}