{
    "name": "Turtle Beach X12  Headset",
    "Manufacturer": "Turtle Beach",
    "Model": "X12",
    "Part #": "TBS-2255-01",
    "Type": "Circumaural",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / Green",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "2.0",
    "Features": "[The Turtle Beach X12 is the definitive headset for gamers seeking amazing game sound, crystal-clear communication and enhanced comfort - all at an unmatched value.  The X12 features massive 50mm speakers, delivering superior audio quality with crisp highs and deep, rumbling lows. The in-line amplifier puts you in control, with quick access to independent game and chat volume controls and variable bass.  If you're serious about gaming, then get serious about the sound. Step up to the X12 and experience game audio like never before., Amplified Audio, Enhances game sounds for a more immersive gaming experience., Microphone Monitoring, Hear your voice in the headset, so you won't have to shout to hear what you're saying., In-Line Amplifier, Independent controls allow for quick adjustments to game audio and chat volumes., Variable Bass Boost, Add depth and realism to the gaming experience with strong yet clear bass., USB Powered, A USB connection provides power to your amplified Xbox 360 headset - no AC adapters or batteries necessary., PC Compatible, Delivers the ultimate gaming experience with the Xbox 360 and PC platforms., Headphones, 50mm diameter speakers with neodymium magnets, Speaker Frequency Response: 20Hz - 20kHz, >120dB SPL @ 1kHz, Condenser Microphone Frequency Response: 50Hz - 15kHz, Cable length: 16 ft. (4.87m), Weight: 6.4 oz (233g), In-line Amplifier, Headphone Amplifier: Stereo DC-coupled, 35mW/ch, THD <1%, Frequency Response: DC - 30kHz, Bass Boost: Variable up to +12dB@150Hz, Mic mute switch, Maximum analog input level with volume control on maximum setting: 2Vpp (700mV rms), 3.5mm plug for line input, 3.5mm plug for mic output, 2.5mm XBOX 360 controller input jack, USB connector for power (5VDC @ <60mA max), Dimensions: Height .5in (1.27cm), Width 2in (5.08cm), Depth .75in (1.905cm)]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/gwrcCJ/turtle-beach-headphones-tbs225501"
}