{
    "name": "CTA Digital US-UGH  Headset",
    "Manufacturer": "CTA Digital",
    "Part #": "US-UGH",
    "Type": "Circumaural",
    "Frequency Response": "20 Hz - 20 kHz",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black",
    "Active Noise Cancelling": "No",
    "Channels": "2.0",
    "Impedance": "16 Ω",
    "Sensitivity at 1 V RMS": "104 dB",
    "Features": "The U.S. Army Universal Gaming Headset with 3D Effect designed by CTA Digital for PlayStation 3, Xbox 360 or PC provides the strategic edge you need for victory in any modern gaming warfare scenario. On the battlefield, often the key to winning isn't firepower but communication. Any seasoned first person shooter player knows all too well that a sure path to defeat is being unable to hear clear signals from your squad or the approaching enemy. Wearing uncomfortable headsets for long periods of gameplay can lead to fatigue as well, but this headset is designed to address these factors, and provide comfort that can last through even the longest of campaigns. The Gaming Headset connects to a monitor or sound system with standard RCA stereo jacks (red and white) and directly to your console's USB port via separate cables, thus allowing users to adjust the volume of in-game audio and chat communication independently with the wired remote. The removable mic can also be easily muted with a simple switch on the remote so you don't have to worry about transmitting every word you say. When you really want to feel like you're on the battlefront and fully hear every distinct game detail, press the 3D Sound Effect button on the remote for a widened audio field that will surround you with the power of triple drivers in each ear. Not only does all this allow for a finely tuned and completely customized audio experience, but the audio quality itself is rich with the dynamic base that all serious gamers crave. You can finally hear subtle details that will give you the competitive advantage, or simply enjoy extended play sessions thanks to the comfortable padding. This headset will give you the flexibility to play on any system and fully control your immersion within the game. Equip yourself with pride using the U.S. Army Universal Gaming Headset with 3D Effect.",
    "pcpartpicker_url": "https://pcpartpicker.com/product/qwhj4D/cta-digital-headphones-usugh"
}