{
    "name": "Turtle Beach DP11  Headset",
    "Manufacturer": "Turtle Beach",
    "Model": "DP11",
    "Part #": "731855021406",
    "Type": "Circumaural",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / Red",
    "Active Noise Cancelling": "No",
    "Connection": "USB Type-A",
    "Channels": "2.0",
    "Features": "[The DP11 delivers the Dolby surround sound advantage to PS3 gamers at an amazing value. Combining the DSS2 surround sound processor with the P11 amplified headset, the DP11 will immerse you in the game with a stunning 360-degree sound field. Featuring multiple EQ presets and adjustable surround sound angles, the DP11 lets you enhance subtle sound cues and customize the audio for any gaming situation. Experience superior sound quality and extreme comfort with its massive 50mm speakers and lightweight design. Separate volume controls provide personalized balancing of game and chat audio, and you can also use P11 headset as a stand-alone PC headset when you're not gaming on your PS3. If you're serious about gaming, then get serious about the sound. Step up to the DP11 and experience game audio like never before., Dolby Surround Sound, Immersive 360 degree audio lets you pinpoint the direction of every sound., Equalizer (EQ) Presets, Multiple EQ presets including bass, treble and midrange boost combinations., Adjustable Surround Sound Angles, Alter the positioning of the surround sound angles to customize your audio experience., Independent Volume Controls, Allows for personalized balancing of game and chat audio., Microphone Monitor, Hear your voice in the headset so you can hear what you're saying., Digital Optical Connection, Delivers the highest quality of digital surround sound., Auxiliary and Analog Inputs, Connect a digital music player or other secondary audio source., USB Powered, No batteries required.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/jp98TW/turtle-beach-headphones-731855021406"
}