{
    "name": "ARCTIC P402  Headset",
    "Manufacturer": "ARCTIC",
    "Model": "P402",
    "Part #": "HEASO-ERM43-GBA01",
    "Type": "Supra-aural",
    "Frequency Response": "20 Hz - 20 kHz",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / Silver",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "2.0",
    "Impedance": "32 Ω",
    "Sensitivity at 1 V RMS": "101 dB",
    "Cord Length": "47\"",
    "Features": "[With powerful bass, the P402 brings you a new sense of excitement in music. The soft and comfortable ear pads provide complete noise isolation with lasting comfort. You will stay connected to your social network thanks to its in-line microphone which allows you to switch between your music and calls - you will never have to take them off., Lasting Comfort, The P402 is focused on wearing comfort and lightweight design. The slimmer cable maintains superior sound quality yet helps to reduce P402 to 130 grams. Its 15 mm thick ultra-comfort earpads allow you to enjoy wearing this pair of headphones around the clock., Linearity, P402 is equally sensitive to all frequencies so that no frequency will be exagerated. You simply get a more accurate playback of your music., In-line microphone - for Smartphones and tablets, Enjoy your music, movies, and even carry on phone conversations with the best sound quality and completely handsfree while being isolated from your surrounding noise., Smartphone Adapter, There are mainly two standards for 3.5 mm jack on Smartphones. We have chosen the dominating standard used by popular manufacturers, such as Apple, HTC, Blackberry, Motorola, Sony Mobile and newer Samsung. Unfortunately, older Samsung models, Sony-Ericsson and others do not follow the same standard. Therefore we have included an extra adapter for your convenience.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/fmXfrH/arctic-cooling-headphones-heasoerm43gba01"
}