{
    "name": "Philips SHO9207  Headphones",
    "Manufacturer": "Philips",
    "Part #": "SHO9207",
    "Type": "Circumaural",
    "Frequency Response": "12 Hz - 24 kHz",
    "Microphone": "No",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / Red",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "2.0",
    "Impedance": "32 Ω",
    "Sensitivity at 1 V RMS": "105 dB",
    "Features": "[40mm neodymium driver for high definition sound, State-of-the-art 40 mm neodymium drivers deliver high definition sound that is crispy and with deep bass. The Crash has been designed and crafted to be among the best sounding, premium headphones that Philips has ever made., Chill out mode for around the neck wearing comfort, The Crash has an innovative 'chill' setting which allows you to relax the headphone for comfortable wearing when it is just hanging around your neck. Simply sliding the lever on the headband down spreads the earcans wider so they do not sit not right under the chin area., Soft, noise-isolating leather cushions, The incredibly soft ear cushions enclose the speakers around your ears to create a perfect seal. You will be able to enjoy all the sound details in your favorite music. Designed to alleviate pressure on your ears, you can wear The Crash headphones in true comfort and for long periods of time., Metal cabinet to protect driver and sound chamber, The Crash has been designed with an aluminum sound chamber that always protects the speaker driver through external crashes or bumps. Even in the most extreme user cases, the sound chamber, which is important for consistent, high quality sound, stays pristine to always deliver the best sound., Acoustically tuned for deep bass with precise clarity, Metal chamber protects driver even in extreme environments, Metal chamber protects driver from impacts., Tough fabric cable with reinforced connectors, The connectors and fabric cable are hefty and reinforced, providing best-in-class bending and pulling cycles for the cable. The cable has been tested to withstand up to 100,000 bending cycles., Ultra flexible TR90 headband, The CRASH's headband is made of TR90, a material that allows for an enormous amount of bending and which always comes back to its original position, maintaining the same clamping force for the headphone even after multiple twists and bends.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/6cdqqs/philips-headphones-sho9207"
}