{
    "name": "Philips SHS4700/28  Headphones",
    "Manufacturer": "Philips",
    "Part #": "SHS4700/28",
    "Type": "Supra-aural",
    "Frequency Response": "12 Hz - 24 kHz",
    "Microphone": "No",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / Silver",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "2.0",
    "Impedance": "24 Ω",
    "Sensitivity at 1 V RMS": "104 dB",
    "Features": "[Bass Beat vents, Bass beat vents allow air movement for better sound with a deep rich bass., Neodymium magnet, Neodynium is the best material for producing a strong magnetic field for greater sensitivity in a voice coil, better bass response and higher overall sound quality., 24k Gold-plated plug, Rest assured that the precious metal gold finishing on the plug will give you a more reliable connection for better quality audio., Super-soft ear cushions, The ear cushions are very soft, and enclose the speakers around the ears to create great sound. With very little pressure on the ears, you can use the headphones comfortably for long periods., Flexible rubber earhooks, The rubber earhooks provide a non-slip grip for an extra secure and comfortable fit, ensuring that the headphones remain in place for hours of comfort. Ideal for active use., Fully adjustable, The adjustable hinge and earhook creates added security and comfort, by adapting to the shape and size of your ear. This helps make a perfect fit that is highly comfortable and also keeps the headphones in place., Tangle-free cable, The tangle-free cable helps you save time since it is less likely to become tangled. This is because it is made from a material that is more rigid material yet maintains its flexibility., Asymmetric cabling system, This simple yet highly effective solution to cable tangling works effectivly by enabling you to hang the cable behind your neck instead of under your chin., Strain relief, A soft, flexible sleeve protects the cable connection from damage that otherwise would occur from repeated bending, extending the product life.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/wsw323/philips-headphones-shs470028"
}