{
    "name": "Mad Catz F.R.E.Q.TE  Headset",
    "Manufacturer": "Mad Catz",
    "Model": "F.R.E.Q.TE",
    "Part #": "MCB434120002/02/1",
    "Type": "Circumaural",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / Blue",
    "Active Noise Cancelling": "No",
    "Channels": "2.0",
    "Features": "[eSport-Level Audio Response, Crisp stereo sound, plush memory foam earcups, and a unidirectional mic make F.R.E.Q.TE an ideal tournament ally no matter which game you play to win., Designed for Domination, F.R.E.Q.TE upholds the same exacting standards as our award-winning R.A.T. gaming mice. Lightweight components are adjustable for a custom fit, yet strong enough to withstand the extreme stress of LAN tournaments. Used with other soldiers in our tenacious TE army - S.T.R.I.K.E.TE keyboard, R.A.T.TE and M.M.O.TE mice - you'll have all the tools needed to crush the competition., Unidirectional Mic Hears Only Your Voice, An advanced microphone is custom-tuned to pick up only your voice during LAN tournaments. You can freely chat with your team even when the arena is screaming your name., Mobile Warrior, Ready for some pre- or post-match tunes? Maybe a film on your smartphone or tablet? F.R.E.Q.TE converts to portable headphones with a simple cable swap. And if a call comes in on your iPhone, Samsung, BlackBerry, or HTC handset, you can use the removable mic to start a conversation., Stay in Command, Intuitive placement of all audio functions provides easy adjustability. Mute the mic, tweak the volume or answer an incoming call, all without having to look at your device., Precision Audio, Hearing all of a game's audio cues can be crucial for success. Big 50mm drivers help ensure you don't miss a beat courtesy of deep bass balanced with clear, crisp mids and highs., Tournament-Qualified Noise Isolation, Luxurious memory foam surrounds your ears with comfort while blocking unwanted distractions. When the action intensifies and the crowd gets loud, passive noise cancellation helps you stay focused and emerge victorious.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/z7hj4D/mad-catz-headphones-mcb434120002021"
}