{
    "name": "Turtle Beach Call of Duty: Ghosts Ear Force Spectre  Headset",
    "Manufacturer": "Turtle Beach",
    "Model": "Call of Duty: Ghosts Ear Force Spectre",
    "Part #": "TBS-4208-02",
    "Type": "Circumaural",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / White",
    "Active Noise Cancelling": "No",
    "Connection": "USB Type-A",
    "Channels": "2.0",
    "Features": "[The Call of Duty: Ghosts Ear Force Spectre Limited Edition premium headset brings tournament-tested build quality, comfort and versatility to the front lines. Connect your mobile phone to the high-performance amp to take calls or listen to music while never leaving the game. From game consoles to mobile devices, the Call of Duty: Ghosts Ear Force Spectre is ready for battle., Customizable Speaker Plates, Customize your Ear Force Spectre with interchangeable speaker plates., Mobile Versatility, Disconnect headset from the inline amp and pop out the removable mic to use with your mobile phone, tablet or portable game systems., Listen to Music & Take Calls..While Gaming, Connect your smart phone or MP3 player to mix in your favorite music or take phone calls while playing., Independent Volume Controls, Separate game & chat volume controls plus mic mute right on the inline amp., Dynamic Chat Boost, Memory foam cushions cozy up to your ears to block out noise and distractions., Adjustable Bass & Treble Controls, Tune bass and treble levels to add depth and realism., Variable Microphone Monitor, Adjust the volume level of your own voice in the headset to avoid shouting., Comfortable, Twist-Cup Design, Soft memory foam cushions on ear cups that rotate-to-flat for wearing around your neck house premium, 50mm drivers also provide noise isolation., Turtle Beach Audio Advantage, With more than 35 years of audio experience, Turtle Beach delivers innovative technology to provide a competitive advantage and the most realistic and immersive audio experience built into a high quality, comfortable headset. Outstanding sound, features and quality. That's why we are #1 in Gaming Audio.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/mgX2FT/turtle-beach-headphones-tbs420802"
}