{
    "name": "Skullcandy SLYR- Assassins Creed 4  Headset",
    "Manufacturer": "Skullcandy",
    "Model": "SLYR- Assassins Creed 4",
    "Part #": "SMSLFY-421",
    "Type": "Circumaural",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Green / White",
    "Active Noise Cancelling": "No",
    "Connection": "USB Type-A",
    "Channels": "2.0",
    "Impedance": "32 Ω",
    "Sensitivity at 1 V RMS": "104 dB",
    "Features": "[Multi-Platform, Ready to roll, right out of the box. The AC4 SLYR's Multi-platform functionality includes everything you need to connect with Xbox 360, Playstation 3, and PCs natively, so you can jump straight into play., Wired Headset, Supreme Sound's enhanced audio and attacking bass make this wired headset ideal for gaming- and any other media where audio quality matters, EZ Stash Mic, Designed for easy and effective gaming communication, the AC4 SLYR's Flip-Up Boom Mic picks up your voice clearly without broadcasting background noise. A quick flip of the mic lets you quickly end transmission and enter stealth-mode., GMX Mixer, Tuning out everything but the soundtrack, or starting a conversation with another player couldn't be easier with the AC4 SLYR's GMX in-line mixer. Conveniently located controls let you dial in the balance between game sounds and voice chat, adjust the onboard volume, and toggle between the custom AC4 EQ settings., Over Ear Desgin, No need to cut your campaign short. With plush ear cushions that adapt to individual ear shapes and resist heat build up, the AC4 SLYR over-ear design provides the perfect seal and eliminates ear fatigue during epically long play, 3 Position, Skullcandy knows that quality sound can tip the balance between life and death, power and poverty, and revenge or betrayal in the open world of Assassin's Creed 4. Working closely with Ubisoft to enhance the subtle details and sound cues of the Assassin's Creed 4 open world, our development team created three customized EQ settings that add a whole new layer of immersive reality.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/gz2kcf/skullcandy-headphones-smslfy421"
}