{
    "name": "Polk Striker P1  Headset",
    "Manufacturer": "Polk",
    "Model": "Striker P1",
    "Part #": "AM1929-A",
    "Type": "Circumaural",
    "Frequency Response": "20 Hz - 20 kHz",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "2.0",
    "Impedance": "32 Ω",
    "Sensitivity at 1 V RMS": "98 dB",
    "Features": "[Powered by 40 years of audio heritage and tuned for heart-pounding Sound Quality, the Striker P1’s sound will elevate your gaming experience by hearing all the detail, all the subtleties in the game., Stay-focused Comfort, Our ProFit Comfort system creates a lightweight headset that helps your gaming concentration, never hinders it. ProFit Comfort is a combination of a lightweight, molded headband with a thick cushion and two-way pivoting ear cups with Protein Leather padding, enabling the Striker headset to rest easily as it conforms to your head., The 40mm drivers were created using Polk’s patented Dynamic Balance? driver design process. This helps eliminate resonances and creates the Striker’s game changing high-quality sound., Retractable, Omni-directional boom microphone, with a 7cm extension, is flexible, so it conforms to the way you like to chat and slides neatly into the ear cup when you're done.  You can even take calls with it if you have it connected to your phone., The in-line controller enables you to set volume level and mute., Superior Build Quality means the Striker headset is a tool you can depend on to give you a gaming edge for years to come., Strain Relief Cable connector at the ear cup ensures the 40-inch cable always keeps you in the game. Two additional split cables enable you to connect to your platform of choice., More than a gaming headset; the Striker brings Polk's legendary sound quality to your favorite movies, music and TV shows.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/bfvZxr/polk-headphones-am1929a"
}