{
    "name": "Mad Catz F.R.E.Q. 5 5.1 Channel  Headset",
    "Manufacturer": "Mad Catz",
    "Model": "F.R.E.Q. 5",
    "Part #": "MCB434030013/02/1",
    "Type": "Circumaural",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black",
    "Active Noise Cancelling": "No",
    "Connection": "[Stereo 3.5mm Audio, USB Type-A]",
    "Channels": "5.1",
    "Cord Length": "79\"",
    "Features": "[Powerful Stereo Sound, Housing oversize speakers which pump out robust stereo sound with a wide dynamic range, the comfortable, spacious earcups provide clean and clear audio reproduction.The skillfully engineered earcup design also helps block out distractions like excessive teammate chatter so you can focus on playing at your best., Precision-Balanced, Extra Large 50mm Drivers with Neodymium Magnets, F.R.E.Q. 5 PC Gaming Headset feeds high-fidelity audio through a pair of amplified 50mm speakers for deep bass and crisp undistorted highs., Tough Yet Lightweight Metal Components, Built to the same exacting standards as the award-winning Cyborg R.A.T. and constructed to survive the stress of LAN tournaments, the F.R.E.Q. 5 couples comfort with sturdiness to accommodate extended gaming sessions. Lightweight metal components provide ample adjustability to give you a customized fit - and the cans even fold flat to support an around-the-neck resting position - all while bringing a level of durability previously unheard of in PC gaming headsets., Detachable Noise-Canceling Microphone with Illuminated Mute Notification, When gaming in loud environments, advanced noise cancelation stifles ambient sounds to ensure your conversations are crystal-clear., Toggling the microphone mute button prevents your teammates from hearing anything you don't want them to, and red LED illumination in the tip of the detachable mic will never make you wonder whether or not they can hear you., Easy to Locate On-Ear Controls, Mute the mic, tweak the volume, and toggle equalizer settings all while keeping your eyes on your monitor., Compatible with MP3 Players and Smartphones, Use the headset's handy quick-release connector to instantly gain MP3 player compatibility and convert the Cyborg F.R.E.Q. 5 into portable headphones. Just swap out its USB cord for the included 3.5mm audio cable and then plug directly into your device.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/PNrG3C/mad-catz-headphones-mcb434030013021"
}