{
    "name": "ROCCAT Kave XTD Stereo Camo Charge  Headset",
    "Manufacturer": "ROCCAT",
    "Model": "Kave XTD Stereo Camo Charge",
    "Part #": "ROC-14-611",
    "Type": "Circumaural",
    "Frequency Response": "20 Hz - 20 kHz",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Camo",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "2.0",
    "Impedance": "32 Ω",
    "Sensitivity at 1 V RMS": "2 dB",
    "Features": "[It doesn't matter how dominant the arsenal, how strong the tactics, how perfect the team; if you can't hear your enemy coming, they'll have the winning edge every time. Our answer? ROCCAT's Kave XTD Stereo Military, a cutting-edge headset with robust, highly tested design, and the highest quality sound experience gamers can engage in. Every sound your combat arena of choice, both loud and subtle, is a crisp, clear aural experience. Ideal for gaming, movies and music, this headset is built for long sessions of wear without ear fatigue. Gaming or otherwise, the Kave XTD Stereo Military ensure that no sound will be left unheard., RICH STEREO SOUND, In gaming, the smallest sounds are often the most important. It's crucial to hear everything from the snap of a twig, to a whispered command. If you can't hear them, but your opponent can hear you, your game might as well be over. The Kave XTD Stereo Military gives you the aural edge with ultra-clear, 50mm neodymium speaker units in each ear cup, ensuring that all sounds big and small, are heard in rich stereo. The speaker units deliver crisp, clear audio with a huge dynamic range, meaning that you hear not only the faintest of sounds but also get ground-shaking low-end sound that puts you right in your favorite games and movies., NOISE-CANCELING DETACHABLE MIC, You're in the heat of battle, attempting to coordinate an attack, but background noise is drowning out your crucial commands. This is a problem with low-quality headsets, but not with the Kave XTD Stereo Military, which features a noise-canceling microphone that blocks out unwanted atmospheric distractions. The result? Your teammates hear only what you want them to, so you can focus on the fight. With an easily accessible clip-on in-cable remote with volume control and mute switch, you have full control over audio from the moment you hit the battlefield.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/qTwqqs/roccat-headphones-roc14611"
}