{
    "name": "Sony MDR-XB300  Headphones",
    "Manufacturer": "Sony",
    "Part #": "MDR-XB300",
    "Type": "Supra-aural",
    "Frequency Response": "5 Hz - 22 kHz",
    "Microphone": "No",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / Silver",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "2.0",
    "Impedance": "24 Ω",
    "Sensitivity at 1 V RMS": "100 dB",
    "Cord Length": "47\"",
    "Features": "[Exclusively engineered by Sony, the extra-large 30mm Extra Bass diaphragm driver units accurately reproduce ultra-low frequency sounds and deliver powerful, deep bass reproduction, Sound leakage and a loss in audio quality are minimized thanks to a sealed acoustic design. Additionally, the MDR-XB300 headphones have an exceptionally wide frequency response from 5-22,000 Hz, Experience comfortable listening with the Extra Bass headphones' over-the head, on the ear supra-aural closed design. The drivers inside the ear cups are angled parallel to your ears to not only reduce pressure, but increase comfort and deliver an unbelievable listening experience., Minimize tangles while you're on the move with the flat yet durable Y-type 3.9ft. (1.2m) cord. Also includes a gold-plated, L-shaped stereo mini plug, ., Built with a direct vibe structure to ensure high audio fidelity, the Extra Bass headphones feature a tightly sealed acoustic design that allows for a high level of sound isolation which reproduces powerful and extended bass sound, Providing more than exceptional sound, the Extra Bass headphones feature ultra-thick, pressure-relieving ear cushions for supreme comfort and better acoustic performance. Each earcup measures 1.2 inches in thickness and 3.1 inches in diameter. Additionally, a seamless structure design offers enhanced wearing comfort, Power Handling Capacity: 1000mW, Design: Over-the-head, Home-music/movie/games, Plug: Gold-plated L-shaped stereo mini, Flat Y-type cord]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/DxXfrH/sony-headphones-mdrxb300"
}