{
    "name": "Sennheiser MM 550  Headset",
    "Manufacturer": "Sennheiser",
    "Part #": "MM 550",
    "Type": "Circumaural",
    "Frequency Response": "15 Hz - 22 kHz",
    "Microphone": "Yes",
    "Wireless": "Yes",
    "Enclosure Type": "Closed",
    "Color": "Black / Blue",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "2.0",
    "Sensitivity at 1 V RMS": "107 dB",
    "Features": "[Features a bass-enhanced normal listening mode (when NoiseGard is bypassed), Turn on the NoiseGard 2.0 for noise reduction and an audiophile, neutral sound quality that represents the truest reproduction of the original mix, Official travel headphone of the NBA's Dallas Mavericks!, NoiseGard 2.0 noise-canceling technology actively reduces outside noise, allowing users to enjoy music in peace, Stereo Bluetooth wireless technology delivers hands-free convenience and hi-fi stereo sound, TalkThrough technology: one press of a button activates an external microphone that allows users to hear fellow passengers or the flight attendant without removing the headset, Invisible microphone ensures crystal-clear conversations, Neodymium magnets and Duofol diaphragms deliver excellent sound reproduction, SRS WOW HD technology for impressive clarity and stronger bass, Large, comfortable ear cups for complete relaxation and luxury in noisy surroundings, Intuitive track and volume controls for enhanced usability and convenience, Collapsible, metal-reinforced headband ensures portability and durability, Includes: protective case, cable and adapters for use in-flight, USB wall charger and cable, quick setup guide, user manual, generous two-year warranty, Due to the nature of Bluetooth technology, users may experience a slight audio latency when watching video on a portable device. The headphones are working fine. This is a characteristic of all Bluetooth headsets. Latency is not an issue for audio-only use, OR when using the included detachable headphone cable for a wired audio connection when watching video., Compatible with latest generation of tablets]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/nMzv6h/sennheiser-headphones-mm550"
}