{
    "name": "Creative Labs Tactic3D Rage Wireless  Headset",
    "Manufacturer": "Creative Labs",
    "Model": "Tactic3D Rage Wireless",
    "Part #": "70GH022000001",
    "Type": "Circumaural",
    "Frequency Response": "20 Hz - 20 kHz",
    "Microphone": "Yes",
    "Wireless": "Yes",
    "Enclosure Type": "Closed",
    "Color": "Black / Red",
    "Active Noise Cancelling": "No",
    "Connection": "USB Type-A",
    "Channels": "2.0",
    "Impedance": "32 Ω",
    "Sensitivity at 1 V RMS": "102 dB",
    "Features": "[High caliber wireless gaming headset, Experience superior, static-free uncompressed wireless gaming audio without any latency., 50mm FullSpectrum drivers, Experience a high-powered, no-holds-barred 3D gaming audio experience with massive bass and detailed highs., Fully customizable audio and illumination, Personalize your headset by customizing every aspect of your audio or earcup illumination settings exactly the way you want it., 3D surround sound, Free yourself from the limits of physical 7.1 audio. Immerse yourself right in the middle of your game., Up to 16 hours battery life, Incredible sound deserves an equally incredible battery life. Play for up to 16 hours at a time with a single charge. You can recharge your headset even while in use, so you'll never need to put your game on hold., Accessible on-ear audio controls, Easily adjust your game volume or mute your microphone on the fly. With the rotary volume control dial, you can make faster, more precise volume adjustments., 16 million-color illuminated ear cups, Put on a color that fits your style or mood. Choose from a dizzying 16 million colors to complement your gaming team, rig, or aura., Take on a persona, With VoiceFX, you can match your voice to your game avatar, be it an orc, elf or alien infiltrator. Dont just play your avatar, BE your avatar., SBX Pro Studio, SBX Pro Studio Suite of effects will transform your audio experience into a High-Definition multimedia adventure.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/rPR48d/creative-labs-headphones-70gh022000001"
}