{
    "name": "Sennheiser MM 450-X  Headset",
    "Manufacturer": "Sennheiser",
    "Part #": "MM 450-X",
    "Type": "Supra-aural",
    "Frequency Response": "15 Hz - 22 kHz",
    "Microphone": "Yes",
    "Wireless": "Yes",
    "Enclosure Type": "Closed",
    "Color": "Black / Blue",
    "Active Noise Cancelling": "No",
    "Channels": "2.0",
    "Sensitivity at 1 V RMS": "107 dB",
    "Features": "[Compatible with latest generation of tablets including the New iPad, Sennheiser NoiseGard 2.0 technology provides up to 90% active noise cancellation, TalkThrough function - Communication with seatmates without removing the headphones, Wireless freedom with Stereo A2DP Bluetooth-- hands-free convenience and hi-fi stereo sound, Supports Apt-X codec for hi-fi sound over Bluetooth, Discrete, invisible microphone is always out of the way, Direct cable option - listen as a wired headphone when Bluetooth is not permitted (note: mobile phone conversations require Bluetooth), iPhone/iPod/iPad compatible, compatible with all 1/8\" (3.5mm) headphone plugs, Easy-to-use controls are within optimum reach and provide concise \"click\" feedback, World-famous Sennheiser acoustics from exclusive DuoFol transducer system, Plush ear cushions seal out ambient noise while maintaining luxurious comfort for hours on-end., Collapsible headset stores in a compact footprint for convenient portability, Replaceable battery charges via USB port or supplied wall adapter, Connect everywhere - to mobiles, laptops, MP3 players, or in-flight entertainment systems with an all-in-one headset solution, Due to the nature of Bluetooth technology, users may experience a slight audio latency when watching video on a portable device. The headphones are working fine. This is a characteristic of all Bluetooth headsets. Latency is not an issue for audio-only use, OR when using the included detachable headphone cable for a wired audio connection when watching video.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/wmXfrH/sennheiser-headphones-mm450x"
}