{
    "name": "Razer Chimaera 5.1 Channel  Headset",
    "Manufacturer": "Razer",
    "Model": "Chimaera",
    "Part #": "[RZ04-00480100-R3U1, RZ04-00480100-R3G1]",
    "Type": "Circumaural",
    "Frequency Response": "20 Hz - 20 kHz",
    "Microphone": "Yes",
    "Wireless": "Yes",
    "Enclosure Type": "Closed",
    "Color": "Black / Green",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "5.1",
    "Impedance": "32 Ω",
    "Sensitivity at 1 V RMS": "105 dB",
    "Features": "[The Razer Chimaera 5.1 Wireless Gaming Headset for Xbox 360 gives you a true-to-life surround sound experience. Building on our extensive gaming audio expertise from PC gaming, this wireless headset offers pinpoint tournament grade 5.1 positional audio with extra large circumaural ear cups for maximum comfort. The base station doubles up as a charging dock and audio processing unit, giving you the option to adjust the game sound and link up to four base stations to talk to your teammates over a lag-free, local communication channel., 5.1 Channel Dolby Surround Sound for Pinpoint Positional Audio - Offering the full range of surround sound, with drivers tuned for 3D positional audio the Razer Chimaera 5.1 Wireless Gaming Headset for Xbox 360 will allow you to anticipate your enemies' every step and hear the true game sound in full detail., 5.8 GHz Frequency Headset for Interference-free Wireless Performance - The Razer Chimaera 5.1 allows a true wireless Xbox experience for up to 8 hours with no cables restricting your movement. Using the 5.8 GHz frequency protects this headset against almost all wireless interferences, Wireless Headset: Circumaural Design with 50mm Driver Units, Volume & Mic Control Buttons on the Headset, 3 Preset EQ, Detachable 2.5mm Microphone Cable, Dimensions: 200mm(W) x 204mm(H) x 88mm(D), Headphones: Radio Frequency: 5.8GHz, Dolby Headphone / Dolby Pro Logic II / Dolby Digital, Wireless Range: 33ft / 10m, Frequency Response: 20-20,000 Hz, Impedance: 32O at 1kHz, Sensitivity (@1kHz, 1V/Pa): 105dB +/- 2dB, Drivers: 50 mm, with Neodymium Magnets, Batteries: 2 AAA Batteries (Up to 8 Hours Battery Life), Charging Time: 3 Hours, Microphone: Frequency Response: 130-10,000 Hz, Sensitivity (@1kHz, 1V/Pa): -42 +/- 2dB, S/N Ratio: >55db]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/hMPfrH/razer-headphones-rz0400480100r3u1"
}