{
    "name": "Logitech G430 7.1 Channel  Headset",
    "Manufacturer": "Logitech",
    "Model": "G430",
    "Part #": "981-000536",
    "Type": "Circumaural",
    "Frequency Response": "20 Hz - 20 kHz",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / Blue",
    "Active Noise Cancelling": "No",
    "Connection": "USB Type-A",
    "Channels": "7.1",
    "Impedance": "32 Ω",
    "Sensitivity at 1 V RMS": "90 dB",
    "Features": "[ON-CABLE CONTROLS, Keep the mute switch and volume dial close at hand for quick, precise audio adjustments. All attached to an extra long, x-meter cable., DOLBY HEADPHONE 7.1 SURROUND SOUND, You can hear up to seven discrete channels of audio data plus the low-frequency effects (LFE) channel, known as 7.1 surround sound. Dolby Headphone technology perceptually positions each channel in the correct location to reproduce multi-channel content the way developers intended., LAY-FLAT EARPIECES, We know even twin gamers are one-of-a-kind. For a personalized fit, the earpieces swivel up to 90 degrees. And because they can turn to lay flat, they're less prone to breakage from everyday wear and tear., SPORTS PERFORMANCE CLOTH EAR CUPS, Marathon gaming sessions mean heat and sweat. We covered the G430 ear cups with carefully selected sports performance cloth for a comfortable, soft touch even after hours of use. And they slip off easily for washing to keep the headset in top shape., LIGHTWEIGHT DESIGN, The G430 earpieces have been designed to be slimmer and lighter, without skimping on audio quality. A lighter, balanced assembly means you stay focused on the game. You might even forget you're wearing a headset., FOLDING, NOISE-CANCELLING MIC, When you want to be heard, you will be-loudly and clearly. The noise-cancelling mic can be adjusted to pick up your voice alone. Don't feel like talking? Easily fold it up and out of the way., FULL-SPEED, ALL-DIGITAL USB, In-game sound isn't an effect. It's a critical component of game play. Our USB headphones surround you with aural information. The sound is crisp and clear, and the jack on your sound card stays open for desktop speakers.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/FWNp99/logitech-headphones-981000536"
}