{
    "name": "Corsair Raptor HS30  Headset",
    "Manufacturer": "Corsair",
    "Model": "Raptor HS30",
    "Part #": "[CA-9011121-NA-Y, CA-9011121-EU-Y]",
    "Type": "Circumaural",
    "Frequency Response": "20 Hz - 20 kHz",
    "Microphone": "Yes",
    "Wireless": "No",
    "Enclosure Type": "Closed",
    "Color": "Black / Red",
    "Active Noise Cancelling": "No",
    "Connection": "Stereo 3.5mm Audio",
    "Channels": "2.0",
    "Impedance": "32 Ω",
    "Features": "[Great gaming sound with a comfortable, closed-back design: The Corsair Raptor HS30 gaming headset is ergonomically designed for better audio quality and the comfort you need to keep your head in the game. The 40mm neodymium audio drivers are enclosed in padded, circumaural earpads that fit around your ears so they’re more comfortable and help block distractions. And, they’re closed back, so your gaming won’t distract anybody, either. The HS30 also has a padded headband, and a noise cancelling microphone that screens out background noise., 40mm neodymium drivers: Enjoy realistic audio reproduction with higher sensitivity, greater detail, and lower distortion., Closed-back, circumaural padded earcups: The earcups block out distracting background noise, so you can keep your head in the game. Closed-back construction helps reduce noise leakage, to help make sure that your gaming won’t bother anybody around you., Noise-cancelling microphone: The microphone automatically reduces background noise, so you’ll be heard loud and clear., Compatible with PC, Mac, PlayStation 4, phones, and tablets: The modular cabling system lets you use the HS30 just about anywhere. The 4-pole 3.5mm connector has integrated audio input and microphone output, for connecting to mobile phones, tablets, PS4 controllers, and newer desktop and notebook computers. Or, use the included Y adapter to split it into separate 3.5mm headphone and microphone connectors for universal compatibility.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/Q9Trxr/corsair-headphones-ca9011121nay"
}