{
    "name": "Adesso AKB-430UG Wired Standard Keyboard With Touchpad",
    "Manufacturer": "Adesso",
    "Part #": "AKB-430UG",
    "Style": "Standard",
    "Mechanical": "No",
    "Backlit": "None",
    "Tenkeyless": "No",
    "Connection Type": "Wired",
    "Normal Keys": "107",
    "Color": "Gray / Black",
    "Mouse Included": "Touchpad",
    "Features": "[Stylish Design with Full Wrist Support, Full-sized 107 Key desktop Windows Vista Enhanced Keyboard with molded ergonomic wrist support. Quiet tactile membrane key switches for longer life. Large ENTER Key and Space Bar. LED indicators for Num Lock, Caps Lock and Scroll Lock., Built-In Touchpad Puts Cursor Control at your Fingertips, Integrated touchpad eliminates the need for a mouse and saves valuable desk space. And it? centrally positioned for ultimate comfort and convenience. The Glidepoint?Touchpad puts cursor control at your fingertips. Navigate, scroll, zoom, access files and enter data all with just a light tough of the finger. It's easy, it's comfortable, and installation is a snap., Hot Keys for Multimedia and Internet One-Touch Access, Hot Keys on the new Win-Touch Pro Desktop Keyboard connect you directly to your favorite multimedia activities with one-touch - navigate music and video clips, surf the Web, start many of the programs you use most, and more.  With these 9 hot keys and a sleek, slim design, this keyboard adds dynamic features and vibrant looks to any desktop., The Adesso Win-Touch Pro Keyboard features an integrated touchpad featuring Glidepoint Technology. The touchpad can take the place of your mouse making it easier than ever to control your PC. The keyboard features quiet tactile keys and a molded wrist rest that supports palms while typing. This keyboard also features 9 hotkeys that launch your important applications and control your multimedia experience- all at the touch of one button.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/qCYXsY/adesso-keyboard-akb430ug"
}