{
    "name": "Phanteks PH-NDC_02 2 g Thermal Paste",
    "Manufacturer": "Phanteks",
    "Part #": "PH-NDC_02",
    "Amount": "2 g",
    "Features": "[The PH-NDC is a superb quality thermal compound for heatsinks. PH-NDC improves the effectiveness of CPU coolers by thermally bonding the CPU to the heatsink. The PH-NDC is a high-purity Nano diamond-like particle paste that helps to ensure maximum heat dissipation for optimized performance and greater system stability., Excellent Performance, PH-NDC is made of NANO diamond-like particles of hybrid compound, design for using in environment with low thermal resistance. PH-NDC’s Nano diamond-like particles helps dissipate and transfer the heat when compressed., No Burn-in Time Required, PH-NDC has no burn-in time that is required to reach maximum performance. Formulated to maximize efficiency instantly when applied., Non-Electrical Conductive TIM, PH-NDC can be applied to any type of Cooler to enhance the thermal conductivity. PH-NDC does not contain any metal or other electrically conductive materials that will harm other components., Easy to Apply and Remove, PH-NDC can be easily applied and removed. Just one pea-sized amount of the PH-NDC will do. Once the CPU cooler is installed the PH-NDC particles will spread and maximize the contact area., Long-term stability, The PH-NDC contains a silicon-free compound that provides excellent long-term stability. The silicon-free compound has an effective thermal cycling, and low dry-out features., Maximum capability of operating temperature., PH-NDC has a maximum capability of an operating temperature of -40°C to 150°C. PH-NDC will provide a stable working status at any extreme temperature and conditions., Color: Grey, Thermal Conductivity: 4.5 W/m-k, Thermal Resistance: 0.14 °C – cm2/W, Specific Gravity: 2.55g/cm3, Recommended Storage Time: < 2 Years, Recommended Usage Time: < 2 Years, Capacity: 2g ( 2 units, 1g/unit), Weight: 55.3g, Operating temperature: -40°C to 150°C]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/PCzZxr/phanteks-ph-ndc_02-2g-thermal-paste-ph-ndc_02"
}