{
    "name": "Arctic Silver Ceramique 2 Tri-Linear 2.7 g Thermal Paste",
    "Manufacturer": "Arctic Silver",
    "Model": "Ceramique 2 Tri-Linear",
    "Part #": "[CMQ2-2.7G, ASC-2.7G, 900100646, AS-CMQ2-27]",
    "Amount": "2.7 g",
    "Features": "[Tri-Linear Ceramic Content: Like the original Ceramique, Ceramique 2 uses only ceramic fillers so it is neither electrically conductive nor capacitive. The tri-linear composite of aluminum oxide, zinc oxide and boron nitride allows the thinnest possible bond line with modern processors, heatsinks and electronics. Critically-sized particles and new ultra-high shear mixing techniques maximize Ceramique 2's thermal performance and help maintain a stable homogenous suspension. This exclusive combination provides performance exceeding most metal based compounds., Polysynthetic Suspension Fluid: A new oil mixture, improved thermal filler properties and increased particle deagglomeration, dispersal and density enhance Ceramique 2's thermal performance and overall stability. The third generation polysynthetic suspension fluid combines advanced synthetic oils to maximize wetting and stability while allowing a higher density of thermally conductive fillers., Excellent Stability: Ceramique 2 is engineered to not separate, run, migrate, or bleed., Electrical Insulator: Ceramique 2 does not contain any metal or other electrically conductive materials. It is a pure electrical insulator, neither electrically conductive nor capacitive., Performance: 2 to 10 degrees centigrade lower CPU full load core temperatures than standard thermal compounds or thermal pads when measured with a calibrated thermal diode imbedded in the CPU core., Innovative Dispenser: The amount of compound remaining in the 2.7-gram syringe is easy to determine as the rear of the plunger is perfectly flush with the flange when the syringe is empty., Easy Clean Up: Ceramique 2 can easily be cleaned from CPUs and heatsinks with ArctiClean, isopropyl alcohol or any of the cleaners listed in the product instructions., Compliancy:RoHS Compliant., Average Particle Size: <0.36 micron <0.000014 inch (70 particles lined up in a row equal 1/1000th of an inch.), Temperature Limits: Peak: -150 Degrees C to >185 Degrees C, Long-Term: -150 Degrees C to 130 Degrees C, Coverage Area: 2.7-gram syringe. (Approximately 1cc), At a layer 0.003\" thick, one syringe will cover about 22 square inches.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/NqCwrH/arctic-silver-thermal-paste-cmq227g"
}