{
    "name": "Apple MB112LL/B Wired Optical Mouse",
    "Manufacturer": "Apple",
    "Part #": "MB112LL/B",
    "Tracking Method": "Optical",
    "Connection Type": "Wired",
    "Color": "White",
    "Features": "[Innovative Scroll Ball and button, Perfectly positioned to roll smoothly under just one finger, Mighty Mouse's Scroll Ball offers full 360-degree scrolling capability — up/down, left/right and diagonally. You can scroll long web pages, pan full-size images, maneuver around large spreadsheets, control a video timeline and more. And you can even click the Scroll Ball to access your favorite Tiger features such as Dashboard, Spotlight., Touch-sensitive top shell, It looks and feels like a sleek one-button mouse, but Mighty Mouse's smooth top shell hides a powerful secret: touch-sensitive technology under the shell detects which part of the mouse you're clicking, so you can both left-click and right-click. And if you prefer the simplicity of a classic one-button mouse, Mighty Mouse is up to the task. Just use the Mac OS X system preference pane to configure it how you want., Force-sensing side buttons, When you give Mighty Mouse a squeeze, force-sensing side buttons can be configured to activate Mac OS X features such as Dashboard, Exposé or a whole host of other customizable features., Customizable, If you have Mac OS X Tiger, Mighty Mouse can give you fingertip access to the special features you love. Simply use the system preference panel to configure Mighty Mouse in the way that makes you most powerful. Control the Scroll Ball's tracking and click functions, as well as the right, left and side click functions. And you even can set up different mouse profiles for every user account on your Mac., Optical Tracking, Powered by a precision optical sensor, Mighty Mouse provides responsive and accurate cursor movement on almost any type of surface — no mouse pad required.]",
    "pcpartpicker_url": "https://pcpartpicker.com/product/jgg323/apple-mouse-mb112llb"
}